{"id":28750,"name":"Droidcon San Francisco","description":"West Coast!","locationName":"SF","startDate":"03/17/2016 09:00AM","endDate":"03/18/2016 06:00PM","venues":[{"id":53800,"name":"Code Lab","description":"","mapImageUrl":"","events":[{"id":54304,"name":"Couchbase","description":"","category":null,"startDate":"03/17/2016 03:30PM","endDate":"03/17/2016 04:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":40201,"name":"Nic Raboy","profile":"Nic is a Developer Advocate for Couchbase in the San Francisco Bay Area.  He has released several native and hybrid mobile applications to iTunes and Google Play and writes about his development experiences related to making web and mobile app development easier to understand.  He has experience in Android, Ionic Framework, Java, NoSQL, SQL, PHP, and Node.js.","avatarKey":null,"userCode":"15059","company":"Couchbase","twitter":"nraboy","linkedIn":"https://www.linkedin.com/in/nraboy","website":"https://blog.nraboy.com","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+NicRaboy","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":54302,"name":"Branch","description":"","category":null,"startDate":"03/17/2016 01:30PM","endDate":"03/17/2016 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":28202,"name":"Evan Groth","profile":"A recovering hacker, Evan has been programming from day one. Evan built the ClassOwl app from blank screen to market in two short months. Evan recently joined Branch Metrics as a member of their evangelist team after building up his Android skills over several years, successfully launching TweetDreams and Excambio Android apps on the Google Play store.","avatarKey":"http://static.sched.org/a6/2199363/avatar.jpg.320x320px.jpg?c27","userCode":"2b0e","company":"Branch Metrics","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":54303,"name":"Firebase","description":"","category":null,"startDate":"03/17/2016 02:30PM","endDate":"03/17/2016 03:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":29551,"name":"Frank van Puffelen","profile":"Frank is an engineer for Firebase at Google. He helps developers build extraordinary apps that use Firebase as their back-end. If you've ever asked a Firebase question on StackOverflow, you've probably met Frank already.","avatarKey":"http://static.sched.org/a6/2207991/avatar.jpg.320x320px.jpg?1fd","userCode":"0639","company":"Google","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":54300,"name":"Fabric","description":"Our Code Lab will be a hands on workshop for getting your Android apps set up with the latest tooling from Fabric- whether that's crash reporting, easy beta distribution setup, analytics, ads, or our open source toolset fastlane, which helps you script some of the more time-consuming aspects of distributing and shipping your app.","category":null,"startDate":"03/17/2016 10:00AM","endDate":"03/17/2016 10:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":54252,"name":"Bear Douglas","profile":"","avatarKey":null,"userCode":"","company":"Twitter","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":53850,"name":"Code Lab: Building a Gesture UI","description":"Learn to build applications which respond to snaps, flicks, and other hand movements while the user’s phone is out of their hand. This session will cover implementation of the Presto library, which uses sensor data from Android Wear devices to build this new category of gesture UI. Participants will build a simple working gesture application and learn best practices for working with gesture. Details at http://presto.watch.","category":null,"startDate":"03/17/2016 04:30PM","endDate":"03/17/2016 05:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":54251,"name":"Sumeet Thadani","profile":"Sumeet has a passion for writing great code and making amazing products. He graduated with an MS in Computer Science from Columbia University. He went on to be a member of the founding team at LimeWire, and worked in Algorithmic Trading at top Wall Street firms. He founded Presto in early 2014.","avatarKey":"User_9df36a89-e5ce-43c3-8108-37b926613964","userCode":"","company":"Presto","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":54301,"name":"Make your own image editing app with the Adobe Creative SDK","description":"The Adobe Creative SDK lets you build applications that integrate with the Adobe Creative Cloud and leverage its power to benefit your users. The Creative SDK offers Creative Cloud content management, creative tools, connected workflows and more.\r\n\r\nIn this session, learn how to integrate the Creative SDK’s Image Editor UI component to quickly and easily build powerful image editing into your Android app. Then learn about how you can continue on to save images from your app to the Creative Cloud with the Creative Cloud Files API, and let your users send their photos directly to Photoshop on the desktop with the Send To Desktop API.","category":null,"startDate":"03/17/2016 11:00AM","endDate":"03/17/2016 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":54253,"name":"Ash Ryan Arnwine","profile":"","avatarKey":null,"userCode":"","company":"Adobe","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":52650,"name":"Track 1","description":"The main room","mapImageUrl":"","events":[{"id":52851,"name":"Android Development Like a Pro","description":"The Android SDK has changed much since its first version. Every new version comes with many new APIs. However, there is no perfect API, some do too much under the hood, others couple your classes to the context, others have more lifecycle events than you have years in your life.\r\nThe talk will show how to make your app scalable, your code clean, your performance optimized and your UI neat. The talk will show in a pragmatic way the pros and cons of using certain Android APIs, strategies and libraries.","category":null,"startDate":"03/17/2016 11:00AM","endDate":"03/17/2016 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":39104,"name":"Israel Ferrer Camacho","profile":"Israel Ferrer Camacho is an Android engineer working at Twitter. Passionate about Android, object oriented design principles, testing and agile methodologies. Ex @lookout and @feverup. Android developer since 2009. Israel is the co-founder of Barcelona GDG.","avatarKey":"https://lh3.googleusercontent.com/-VGhB4zrSXao/AAAAAAAAAAI/AAAAAAAATao/FHOy_YSB3v0/s96-c/photo.jpg","userCode":"d66e1","company":null,"twitter":"rallat","linkedIn":null,"website":"http://israelferrer.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52950,"name":"Better Android Development with Kotlin and Gradle","description":"In this talk, Ty will walk you through setting up and using Kotlin with Gradle to streamline your workflow for Android development by focusing on using Kotlin's advantages within the Gradle build toolchain. After a brief overview of some useful Kotlin features, we'll dive into how it can be used with Gradle to accelerate day to day Android Development, while using a consistent language throughout the entire development stack, all on a real world example, by building a Gradle plugin in Kotlin.","category":null,"startDate":"03/17/2016 01:30PM","endDate":"03/17/2016 02:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":5666,"name":"Ty Smith","profile":"Ty is an Android Tech Lead at Twitter, focusing on developer tools on the Fabric team. \r\n\r\nHe has been specializing in Android for over 7 years and is a member of the GDE (Google Developer Expert) program. He regularly speaks at international conferences on Android development and co-organizes the SF Android Meetup group and the Droidcon SF conference.He has taught Android development at Missionbit and is a member of the technical advisory group, Speciality Types, providing guidance to startups.\r\n\r\n Prior to Twitter, Ty worked on the Evernote Android App and lead the SDK and partner integrations work, lead a messaging platform for Sprint under the company One Louder Apps, and built Zagat for Android prior to the Google acquisition.","avatarKey":"70ebe615-52c6-40ef-a99e-f5ca5b3837bc","userCode":"d66e","company":"Twitter","twitter":"tsmith","linkedIn":null,"website":"tysmith.me","email":null,"phone":"(415) 494-7217","phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"507e5e4b-fe89-41f1-a75d-542eb33787d9_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":52852,"name":"Application Architecture - Designing Offline Application Case Studies","description":"This is a follow up talk to Android Application Architecture IO'15 Session. (http://bit.ly/1KSLpAN). After a quick review, we'll go over a list of case studies and see how they can be implemented for better user experience and performance.","category":null,"startDate":"03/18/2016 10:10AM","endDate":"03/18/2016 10:50AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":39952,"name":"yiğit boyar","profile":"I work in the UI Toolkit Team, mostly focused on RecyclerView and Data Binding.","avatarKey":"https://lh6.googleusercontent.com/-cyR5gv_WRtY/AAAAAAAAAAI/AAAAAAAAAAA/pykLSUtih5g/s96-c/photo.jpg","userCode":"b408c","company":"Android / Google","twitter":"yigitboyar","linkedIn":null,"website":"birbit.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52952,"name":"Mastering CoordinatorLayout Behaviors","description":"The Android Design Support Library is full of interesting widgets, but none are more powerful than the CoordinatorLayout. Billed as a “super-powered FrameLayout”, it provides a framework for building complex touch interactions and behaviors between related views. It builds on the nested scrolling behavior built into views starting with Android 5.0, and backported in the latest support library releases.\r\n\r\nCoordinatorLayout exposes these complex interactions in the form of Behaviors. We will be discussing how CoordinatorLayout uses Behaviors to accomplish its goals. You will also learn what behaviors are available from the support library…and how to create your own.","category":null,"startDate":"03/17/2016 03:30PM","endDate":"03/17/2016 04:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":30226,"name":"Dave Smith","profile":"Dave Smith is the Android Lead at NewCircle, an organization focused on open source training, where he designs courseware to empower new and experienced Android developers. Since 2009, he has developed with Android at all levels of the stack—from writing high-profile user applications to embedding Android into industrial equipment. He is a Google Developer Expert for Android, author, trainer and speaker.","avatarKey":"b1f745ce-e139-4161-baf3-907224eb0e59","userCode":"c4cec","company":"NewCircle","twitter":"devunwired","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":"+DaveSmithDev","nickname":null,"coverKey":"f92745bd-048e-49b1-bf0e-583262c22885_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":52957,"name":"The Jack and Jill build system","description":"Several months ago, Google quietly introduced the experimental Jack and Jill compilers for Android apps. The compilers replace the existing Java and Dex compilers. They still translate Java source code to Dalvik bytecode, so at some level, it may seem like a small change.\r\n\r\nIn this presentation, I'd like to discuss the implications for developers. How can you start using the compilers? What are the advantages? Are there any disadvantages? I'll also provide some insight in the underlying technology, such as the Gradle build process and the new Jayce bytecode representation, which may impact the Android ecosystem more profoundly.\r\n","category":null,"startDate":"03/18/2016 11:50AM","endDate":"03/18/2016 12:30PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":42600,"name":"Eric Lafortune","profile":"Eric is the creator of the open-source optimizer and obfuscator ProGuard, and its commercial extension DexGuard. He is obsessed with making applications more compact, more efficient, and better protected against attacks. He is the founder and CTO of GuardSquare, where they put this obsession to good use.","avatarKey":null,"userCode":"1dd05","company":"GuardSquare","twitter":"GuardSquare","linkedIn":"www.linkedin.com/in/ericlafortune","website":"www.guardsquare.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52958,"name":"Android Internal Library Dependency Management","description":"As your app code gets larger and more complex, it makes sense to break your project out into smaller reusable components. But what’s the best way to do this? How can you clearly version your internal libraries?  What kind of setup and maintenance can you expect? How much could it slow down development time?\r\n\r\nIn this talk we’ll dive into the various ways you can manage internal library dependencies. We’ll chat about the current state of Android dependency management, Gradle multi-project builds, Git submodules, and creating a private maven repository in Artifactory. The speaker will share real-world examples, and the pros and cons of each approach.\r\n","category":null,"startDate":"03/18/2016 01:30PM","endDate":"03/18/2016 02:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":38305,"name":"Kelly Shuster","profile":"Kelly Shuster is an Android Developer at thoughtbot and a Google Developer Expert for Android.  Prior to mobile development, she worked as an Embedded Firmware Engineer focused on disk drive read channel optimization.  She holds a Bachelor’s of Science in Electrical & Computer Engineering with minors in Computer Science and Political Science from the University of Colorado, Boulder.\r\n\r\nKelly is currently the director of Women Who Code Denver, and enjoys sharing technical knowledge wherever she goes, from local meetups to international conferences.  When not programing, she can be found dancing in a ballet studio or playing in the Rocky Mountains.","avatarKey":"https://lh4.googleusercontent.com/-JY9xzjbs548/AAAAAAAAAAI/AAAAAAAAHhQ/XH4aO-4sC8U/s96-c/photo.jpg","userCode":"2164e","company":"thoughtbot","twitter":"KellyShuster","linkedIn":"https://www.linkedin.com/in/kellyshuster","website":"http://www.kiodev.com/","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+KellyShuster","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52959,"name":"Android Developer Options Deep Dive","description":"Testing an app on your perfect Nexus 5 device under perfect network conditions works great, but you're getting reports of strange behavior from the wild and weird crashes that you can't reproduce. This talk will walk through some of the more complex options on the Developer Options screen in the Android OS and discuss how a developer can use them to debug problems in their application. Topics covered include: showing surface updates to help you find layout loops in your app, showing layout bounds to get your views pixel perfect, and aggressively killing processes and activities to ensure that your app performs well under stress. We'll cover these options and more as we dive deep into debugging apps.","category":null,"startDate":"03/18/2016 02:20PM","endDate":"03/18/2016 03:00PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24403,"name":"Andrea Falcone","profile":"Andrea Falcone is a senior software engineer at Twitter, working on the Beta by Crashlytics and the Fabric platform. She has developed for the Fabric and Crashlytics Android SDKs and tools (plugins for Ant, Maven, Gradle, IntelliJ, Android Studio and Eclipse!) as well as the Beta by Crashlytics Android app.","avatarKey":"http://static.sched.org/a6/2124589/avatar.jpg.320x320px.jpg?744","userCode":"a318","company":"Twitter/Fabric","twitter":"asfalone","linkedIn":null,"website":"fabric.io","email":null,"phone":"6177558745","phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52960,"name":"Exploring Custom Activity Transitions, pre and post Lollipop.","description":"Android has always allowed to write custom transitions between activities, but they only became popular after the introduction of an official API in Lollipop.\r\n\r\nThis is an In-depth presentation comparing these 2 different methods (pre and post lollipop), their strengths and weaknesses, explaining how they work and when to use them to achieve the most delightful transitions.\r\n","category":null,"startDate":"03/18/2016 03:30PM","endDate":"03/18/2016 04:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":40402,"name":"Joaquim Verges","profile":"Android Fanatic! UI Android Engineer @ Twitter, also the proud developer of Falcon Pro, Hacked and Flyne.","avatarKey":"https://lh5.googleusercontent.com/-xRVZnriWKXI/AAAAAAAAAAI/AAAAAAAANRY/hIBvrqeDriU/s96-c/photo.jpg","userCode":"482d4","company":"Twitter","twitter":"joenrv","linkedIn":"https://www.linkedin.com/pub/joaquim-vergès/17/623/5bb/en","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52951,"name":"Loving Lean Layouts","description":"XML layouts are a fundamental part of Android development at all levels. Getting\r\nstarted is straightforward but creating efficient layouts while still achieving\r\na high-level of control takes some practice and a few tricks.\r\n\r\nIn this session we will look at creating lean yet lovely layouts. We will\r\ndiscuss use cases and best practices for standard layouts, recognizing when a \r\ncustom layout is for you, common mistakes and misconceptions, and some tricks\r\nand situational techniques.\r\n\r\nNote to Droidcon: Just gave this @ BABBQ and got a lot of great feedback. Just saying. :)","category":null,"startDate":"03/17/2016 02:30PM","endDate":"03/17/2016 03:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":5687,"name":"Huyen Dao","profile":"Huyen Tue Dao is a developer specializing in native Android and iOS development.  She graduated with a BS and MS in Computer and Electrical Engineering from the University of Maryland, College Park and has been developing for Android since 2010. The only other thing that keeps her up as late as development (and often longer) is gaming: PC, console, board, card, anything.","avatarKey":"http://static.sched.org/a6/1356594/avatar.jpg.320x320px.jpg?c91","userCode":"84e4","company":"Randomly Typing","twitter":"queencodemonkey","linkedIn":"https://www.linkedin.com/in/huyentuedao","website":"randomlytyping.com","email":null,"phone":"7203236502","phoneticName":null,"gPlus":"https://plus.google.com/+HuyenTueDao","nickname":null,"coverKey":"1bac278f-782f-4464-9d53-6828c68551a2_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":52850,"name":"Common RxJava Mistakes","description":"RxJava is a powerful framework, but there are a lot of common issues developers run into when getting started with it. We'll go over a bunch of common mistakes and and best practices when it comes to working with RxJava.\r\n\r\nThis talk assumes a beginner's knowledge of RxJava.","category":null,"startDate":"03/17/2016 10:00AM","endDate":"03/17/2016 10:40AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":25872,"name":"Dan Lew","profile":"I've been an Android developer for almost six years. I started at Mobiata (FlightTrack), went on to lead the Android team at Expedia, and am currently working at Trello. I'm an Android Google Developer Expert and have been giving talks at local meetups and conferences for the last several years. I've released a couple minor open source Android libraries and several open source apps on Github (<a href=\"http://github.com/dlew\" target=\"_blank\">http://github.com/dlew</a>). I also write regularly about Android development (<a href=\"http://blog.danlew.net/\" target=\"_blank\">http://blog.danlew.net/</a>).","avatarKey":"http://static.sched.org/a6/2124580/avatar.jpg.320x320px.jpg?804","userCode":"4c73","company":"Trello","twitter":null,"linkedIn":null,"website":"http://danlew.net","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52955,"name":"Sharper Better Faster Dagger ‡","description":"For the past 3 years, Square Register Android has leveraged Dagger † to wire up Java objects. However, the app scope hierarchy and complexity increased and we started having bugs and crashes related to scoping errors. This talk will show how to structure an app around Dagger2 ‡ and present a strategy for incrementally migrating from Dagger1 to Dagger2.","category":null,"startDate":"03/17/2016 12:00PM","endDate":"03/17/2016 12:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":48700,"name":"Pierre-Yves Ricau","profile":null,"avatarKey":"https://lh6.googleusercontent.com/-DebbIgbBebE/AAAAAAAAAAI/AAAAAAAAAXg/JouRCqpalac/s96-c/photo.jpg","userCode":"f25f3","company":null,"twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":30201,"name":"John Rodriguez","profile":"","avatarKey":"9f2c98dd-2236-4cb7-8813-ae025cb5eba0","userCode":"df7d0","company":"Square","twitter":"jrodbx","linkedIn":"","website":"","email":null,"phone":"(646) 301-9029","phoneticName":null,"gPlus":"","nickname":null,"coverKey":null,"facebook":"","emailPublic":false,"following":false}]},{"id":53851,"name":"Keynote","description":"","category":"Develop","startDate":"03/17/2016 09:10AM","endDate":"03/17/2016 10:00AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":53950,"name":"Chet Haase","profile":"Chet is the lead of the Android UI Toolkit team at Google, where he works on animations, graphics, and performance. He also writes technical articles, writes and performs comedy, and gives presentations at developer conferences like this one.","avatarKey":"User_d7c03228-6cd1-43fc-af80-42f250f84ae7","userCode":"","company":"Google","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":53951,"name":"Romain Guy","profile":"Romain Guy works at Google on an unannounced project. Before that he spent 7 years working as an Android Software Engineer, primarily focusing on anything graphics and animations related.","avatarKey":"User_470a2852-66d8-4430-a6eb-95542aa2e28e","userCode":"","company":"Google","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52956,"name":"Developing Mobile Experiences at Facebook's scale","description":"Today, Facebook serves over 1.39 billion mobile monthly active users. As Facebook mobile usage has grown significantly over the last years, we evolved from a small team of engineers developing our Android applications to dozens of product and infrastructure teams all thinking mobile first and contributing to the mobile codebases.  We shifted our focus into developing methods that facilitate the distributed development across dozens of different teams so we can bring top notch features to our users fast. In this talk, we will talk about the general lifecycle for releasing features weekly on Android at Facebook and will describe different tools and architectural patterns we have found useful for ensuring code stability and encouraging code reuse across multiple teams.","category":null,"startDate":"03/18/2016 11:00AM","endDate":"03/18/2016 11:40AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":48351,"name":"Jenny Yuen","profile":"Jenny Yuen is the Engineering Manager for Facebook's News Feed experience focusing on Android. Her team focuses on building high quality mobile experiences for over 1.49 billion mobile monthly active users so people can stay connected to their friends, family, and events around the world. Before working on News Feed she was an Android Developer for Facebook Home and prior to that she was a Computer Vision researcher. Jenny received her PhD and Masters in Computer Science from the Massachusetts Institute of Technology and her Bachelors in Computer Engineering from the University of Washington.","avatarKey":"https://lh4.googleusercontent.com/-s65673Vrg64/AAAAAAAAAAI/AAAAAAAAEOM/j748l2sGdLs/s96-c/photo.jpg","userCode":"387cd","company":null,"twitter":"jennyyuenz","linkedIn":"https://www.linkedin.com/in/jenny-yuen-1335721","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":"www.facebook.com/jenny.yuen","emailPublic":false,"following":false}]},{"id":52961,"name":"Video Playback – How Facebook measures video playback performance and how we improved it","description":"The purpose of this presentation is to share Facebook's insights on video playback on Android. Topics covered:\r\n- the metrics we use to quantify video playback experience\r\n- the set of techniques we used to improve the metrics and the overall architecture we arrived at\r\n- and finally, high level learnings from this work spanning a 1 year period\r\n\r\n(will be doing this talk jointly with Marek Latuskiewicz)","category":null,"startDate":"03/18/2016 04:20PM","endDate":"03/18/2016 05:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":48400,"name":"Rama Karve","profile":null,"avatarKey":null,"userCode":"a87ef","company":"Facebook, Inc","twitter":null,"linkedIn":"https://www.linkedin.com/in/rama-karve-9553431","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":"https://www.facebook.com/rama.karve","emailPublic":false,"following":false}]},{"id":52953,"name":"Engaging User Experiences: Periscope Hearts and Chats","description":"Periscope is a live streaming video app that makes watching broadcasts a truly interactive experience. Viewers can participate in a live broadcast by sending hearts and chats to the broadcaster. This talk will provide insight into how the Android team built this core user experience. You’ll learn what gives hearts their light, airy feel, how they flutter on the screen, and how chats animate on and off the screen. We’ll describe the why, what, and how behind them, and walk through actual code that powers these custom views and animations.","category":null,"startDate":"03/18/2016 09:20AM","endDate":"03/18/2016 10:00AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":49252,"name":"Lien Tran","profile":"Lien is a Staff Software Engineer at Twitter, currently building Periscope for Android. Before joining the Periscope team, she was a tech lead on the Fabric platform, and a lead engineer on Twitter for Android. She has been developing mobile apps since 2009.","avatarKey":"https://lh5.googleusercontent.com/-r8acvN0lSc0/AAAAAAAAAAI/AAAAAAAAAF8/FZq4-ilYhjM/s96-c/photo.jpg","userCode":"3773d","company":"Twitter","twitter":"@lientm","linkedIn":null,"website":null,"email":null,"phone":"4084211719","phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52954,"name":"Mutative Design: What it's like to use a mutative interface","description":"Design shouldn’t just adapt to screen size.\r\n\r\nContext isn’t all about adding more information.\r\n\r\nMutative design is a new methodology that hopes to address the problems inherent in designing for averages. It looks to create interfaces and experiences that are born, live, and evolve according to a user's ongoing realities, providing a no-compromise design that accounts for every user, regardless of vision level, data access, physical ability, or even tech savvy. The first steps in thinking about and experimenting with this methodology were made with the introduction of Project Phoebe in December (hello.phoebe.xyz), and now it's time to take a look at Phoebe's latest steps.\r\n\r\nIn this talk we'll unpack what it's like to actually use and live with a mutative interface, how mutations may be automatically selected for using aggregated information about various user states, and how to ensure users feel comfortable with an interface that may change and grow as they do.","category":null,"startDate":"03/17/2016 04:30PM","endDate":"03/17/2016 05:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":28802,"name":"Liam Spradlin","profile":"Liam Spradlin is a UIUX and visual designer working on Android and occasionally iOS. He’s the lead designer at touchlab, America’s top Android development and design shop.\r\n\r\nLiam has worked with clients including GE Appliance, the National MS Society, and the independent developers of apps like Nova Launcher, AllCast, Today Calendar, and Focus creating compelling interfaces, experiences, print layouts, and visual assets.\r\n\r\nAt touchlab, Liam helps partners craft Android experiences with great design as a foundational principle, whether the product is Android-first or expanding from other platforms.\r\n\r\nHis approach with any design, whether it’s a brand new product yet to be shaped or an existing one with millions of users, is to figure out the essentials - what does it do? What does the audience need and expect? How can we best facilitate the former and satisfy the latter?\r\n\r\nWhether it’s type design, interface, or illustration, Liam spends a lot of his free time continuing to explore design. Outside of that, you can find him behind a camera or writing blog posts.","avatarKey":"976cbd85-d908-4482-887b-cc0ec9ff6451","userCode":"31fe","company":"touchlab","twitter":"liamspradlin","linkedIn":"https://www.linkedin.com/in/liamspradlin","website":"touchlab.co","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/+LiamSpradlin","nickname":null,"coverKey":"55a908c3-7bd9-4d0d-8807-32ded06ab5a8_cover","facebook":null,"emailPublic":false,"following":false}]}]},{"id":52651,"name":"Track 2","description":"","mapImageUrl":"","events":[{"id":52963,"name":"Dexter’s Lab: Understanding and Experimenting with MultiDex","description":"While the 65k method limit on the Dex file format was once a problem that could be blissfully ignored, the current reality is that a very large number of developers have already hit this limit, and many others will hit it soon! Before (and even after) you take the MultiDex plunge, there are some significant performance consequences you should be aware of.\r\n\r\nThis talk is all about MultiDex: what it is, why it’s necessary, how it works, what the real consequences are (with data), and some tricks you can use to get around these issues.","category":null,"startDate":"03/17/2016 11:00AM","endDate":"03/17/2016 11:40AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":48555,"name":"Timothy Mellor","profile":"Tim is an Android developer for Yelp in San Francisco. He’s worked on Android since 2011, and is passionate about building high-impact apps with great user experience. Outside of work, Tim is an avid cyclist and hiker.","avatarKey":"https://lh4.googleusercontent.com/-ofX3Eprexc4/AAAAAAAAAAI/AAAAAAAAceU/yOmSahR0DTM/s96-c/photo.jpg","userCode":"33e26","company":"Yelp","twitter":"tfmellor","linkedIn":"https://www.linkedin.com/in/tmellor","website":null,"email":"timothy.mellor@gmail.com","phone":"5015540652","phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":true,"following":false}]},{"id":52964,"name":"Sync Adapters, Demystified","description":"The sync services framework is one of the best assets of the Android platform.  It helps you keep your app’s data up to date while still being friendly on battery, and helps you build an app that can work better while offline.  We’ll talk about when and where you might want to use the sync services.\r\n\r\nHowever, there are a lot of moving parts in the sync framework, and it looks a little scary up front.  Fear not. We’ll dive into an open source example project to show how to use the sync services in a clean and testable way.  We'll also cover over some pitfalls you might encounter while using sync services, and how to avoid them.\r\n\r\nYour users who commute via subway will thank you!","category":null,"startDate":"03/17/2016 12:00PM","endDate":"03/17/2016 12:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":30204,"name":"Ben Oberkfell","profile":"Ben is an Android developer at American Express.  \r\n\r\nPreviously, he developed Android and iOS applications for Jive Software.  Before discovering mobile development, he worked on the Human Genome Project and cancer research projects writing data analysis tools.","avatarKey":"57777d7d-2685-4848-a11c-28395430427f","userCode":"25b28","company":"American Express","twitter":"benlikestocode","linkedIn":"http://LinkedIn.com/in/benoberkfell","website":"http://benlikestoco.de","email":null,"phone":null,"phoneticName":null,"gPlus":"+BenOberkfell","nickname":null,"coverKey":"d183bd20-53cf-4442-bf3d-57024d61433c_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":52967,"name":"Understanding Performance In The Wild","description":"This talk will discuss the way Facebook approaches the analysis of the production performance of the Facebook Android app. We will cover some of our existing tools, as well as our newest production tracing system.\r\n\r\nFacebook faces extreme challenges in performance measurement and diagnostics - from the fast-moving code base, through the wide spectrum of devices, to the variable conditions that the app is used in. Developing within these constraints has led to solutions involving byte code instrumentation, databases for performance markers, as well as heavy automation, analysis, and monitoring. This talk will cover in some detail the end-to-end flow as a product engineer as well as our overall vision.","category":null,"startDate":"03/17/2016 03:30PM","endDate":"03/17/2016 04:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":48701,"name":"Delyan Kratunov","profile":null,"avatarKey":"https://lh6.googleusercontent.com/-k2_mjKYH4eQ/AAAAAAAAAAI/AAAAAAAAB8k/egiDRP5MYJs/s96-c/photo.jpg","userCode":"0967f","company":"Facebook Inc.","twitter":"BurntBrunch","linkedIn":null,"website":null,"email":null,"phone":"650-862-2571","phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":"facebook.com/delyan.kratunov","emailPublic":false,"following":false}]},{"id":52972,"name":"Forks, Fragmentation, and the Future of Android","description":"Android powers more than 80% of smartphones worldwide and shipped on over 1 billion devices in 2014. However the hidden story in these numbers is that Android forks now account for over 20% of the global Android ecosystem and 41% of new devices. Early on “fragmentation\" was an issue of screen size, display density, and platform version. The new “fragmentation” is forked versions of the OS and alternate app stores.\r\n\r\nThis talk explores the Android Open Source Project (AOSP) and popular forks like Cyanogen, FireOS, and MIUI, as well as Google Play Services (Google’s fork of Android). We will introduce specific strategies to help developers reach a wider audience with their applications.\r\n\r\nThis talk will address the following questions:\r\n\r\n1. How does the Android Open Source Project (AOSP), Compatibility Test Suite (CTS), and Google Play Services help shape the global Android ecosystem?\r\n\r\n2. Which forks of Android and which alternate app stores present the greatest opportunities for developers to reach a wider audience with their apps?\r\n\r\n3. What are some strategies developers can use for building applications that are compatible with both Google and non-Google versions of Android?","category":null,"startDate":"03/18/2016 11:50AM","endDate":"03/18/2016 12:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5688,"name":"Chuck Greb","profile":"Chuck Greb is a mobile software craftsman practicing clean code, responsive design, and test-driven development. He has been developing Android libraries and applications since platform version 2.0 Eclair launched on the original Motorola Droid. Since then he has helped build successful applications for companies including Comcast, MeetMe, HowAboutWe, and AWeber Communications.<br /><br />He is currently an Android developer at Mapzen where he crafts tools for building location-based mobile apps that leverage the power of open source and open data. As co-coordinator Android Alliance Philly and GDG Philadelphia, he helps promote and support the local development community. He also builds and plays traditional drums from Guinea, West Africa.","avatarKey":"103db696-3d7e-43e4-800a-cab5b55c3057","userCode":"58c6","company":"Mapzen","twitter":"","linkedIn":"","website":"","email":null,"phone":"","phoneticName":null,"gPlus":"","nickname":null,"coverKey":"56be7ae4-93d2-4138-99ce-0e991fc63837_cover","facebook":"","emailPublic":false,"following":false}]},{"id":52962,"name":"10 ways to analyse runtime failures with ClassyShark ","description":"ClassyShark - a handy Android executables viewer, https://github.com/google/android-classyshark. I am Boris Farber, Developer Advocate at Google, focusing on Android data intensive apps. I want to show how using ClassyShark you can analyse and troubleshoot the most painful problems around runtime failures.\r\n\r\n1. Obfuscation\r\n2. Dependencies\r\n3. Multidex\r\n4. JNI & Native code","category":null,"startDate":"03/17/2016 10:00AM","endDate":"03/17/2016 10:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":24400,"name":"Boris Farber","profile":"Android and JVM Programming Expert. I enjoy the challenges of design, languages and frameworks. I aim for simple solutions to complex problems.As a Developer Advocate I help promote Android APIs. I act as a bridge between internal teams and developers building apps and solutions on top of Android APIs.- Consult about Android App structure and effective practices- Present in major conferences about Android framework- Solve Android issues around runtime, framework and JNI","avatarKey":"http://static.sched.org/a6/2124591/avatar.jpg.320x320px.jpg?c54","userCode":"43ba","company":"Google","twitter":"borisfarber","linkedIn":"https://uk.linkedin.com/in/borisfarber","website":"www.api-solutions.com","email":"boris.farber@gmail.com","phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"4c0930eb-dec3-4f07-90b5-f8e2f7346a84_cover","facebook":null,"emailPublic":true,"following":false}]},{"id":52970,"name":"View only Android apps at scale","description":"Using plain views in favor of activities and fragment has become a hot Android topic, but many wonder if this works for larger apps. One year ago we rebuilt the Lyft app to use only views, and while there are downsides, we are still glad we did.\r\nIn this talk we will tell you why we switched, and show how to do it using Scoop framework we recently released. (https://github.com/lyft/scoop)","category":null,"startDate":"03/18/2016 10:10AM","endDate":"03/18/2016 10:50AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":39156,"name":"Alexey Zakharov","profile":"Alexey Zakharov is the Lead Android Engineer at Lyft. He solely created first version of Lyft Android app during company's early days. Now he is focused on internal frameworks and practices to scale Android development within Lyft.","avatarKey":"https://lh5.googleusercontent.com/-lA1J7JSDCM4/AAAAAAAAAAI/AAAAAAAAABI/0kYlHVN8mK0/s96-c/photo.jpg","userCode":"1903b","company":"Lyft Inc.","twitter":"azakharov","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52965,"name":"Timing is Everything: How to use Timer, Handler, and AlarmManager for your timing needs","description":"Have you ever wondered when you should use Handlers over AlarmManagers? What about Timers and TimerTasks? In this talk, we'll walk through several code examples demonstrating basic usages of these three classes, and then cover advantages and disadvantages of each approach. By the end, you'll feel comfortable tackling your own timing-related features!","category":null,"startDate":"03/18/2016 02:20PM","endDate":"03/18/2016 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":35191,"name":"Katheryn Shi","profile":"Katheryn Shi is an Android developer at Coursera, a start-up focused on providing universal access to the world’s best education. She started her time at Coursera as their 2nd iOS engineer back in Jan. 2014, and she wrote the foundations of Coursera’s universal app. She had the chance later that year to switch to Coursera's Android team, and she's proud to reach audiences in developing countries, who may not have access to desktops or iPhones. In her spare time, Katheryn ice skates and bakes cheesecakes to share.","avatarKey":"71fe8bec-74c2-4576-be85-c3d37b933d87","userCode":"801a9","company":"Coursera","twitter":"katfishi","linkedIn":"https://www.linkedin.com/in/katherynshi","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52975,"name":"What's Peer-to-peer (P2P) and how to create offline Mobile Apps","description":"Your Mobile apps can talk to other mobile apps all between each other without needing a server! \r\n\r\nUsing bluetooth, mobile apps can exchange content amongst each other without requiring a server or network connections.\r\n\r\nWith Couchbase Lite, you can enable Peer-to-peer (P2P) sync between two or more devices.\r\n\r\nBring your laptops and code along with William who will show you how to build a peer-to-peer mobile photo-sharing app, step-by-step, from scratch.\r\n\r\nYou will see how the core code for sending and receiving photos is barely 100 lines of code and contains zero code directly involved in network communication.\r\n\r\nCome learn about how to enable your mobile apps to have a better experience without needing a server. We will code together a sample app and demo how photo sharing with peer 2 peer technology can create apps of the future.","category":null,"startDate":"03/17/2016 02:30PM","endDate":"03/17/2016 03:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5692,"name":"William Hoang","profile":"William Hoang is a Developer Advocate on the Mobile Engineering/Developer Experience team at Couchbase. His love for coffee and code has transcended him into the world of mobile while appreciating the offline in-person experiences.&nbsp;<br /><br />Prior, William worked on the Developer Relations team over at Twitter, BlackBerry, and Microsoft while also having been a Software Embedded GPS engineer at Research In Motion.&nbsp;William graduated from McGill University in Electrical Software Engineering<br /><br />Twitter: www.twitter.com/sweetiewill<br />LinkedIN: www.linkedin.com/in/williamhoang/","avatarKey":"http://static.sched.org/a4/1356574/avatar.jpg.320x320px.jpg?2fc","userCode":"dfa7","company":"CouchBase Inc.","twitter":"sweetiewill","linkedIn":"https://www.linkedin.com/in/williamhoang","website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52971,"name":"Linty Fresh","description":"Have you ever wanted to write your own special Lint check? Or maybe you've wondered just how Lint checks work? Come learn everything that you've ever wanted to know about Lint and more!","category":null,"startDate":"03/18/2016 11:00AM","endDate":"03/18/2016 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":32353,"name":"Matt Compton","profile":"Matt Compton is an Android Developer and Instructor for Big Nerd Ranch, where he works both to solve challenging problems and teach others how to. From his home in Atlanta, he enjoys playing board games, solving puzzles, and trying out new technology.","avatarKey":"ae3a37d4-a90b-4aef-a8d0-52019b550ca5","userCode":"f902e","company":"Big Nerd Ranch","twitter":"Ambergleam","linkedIn":"https://www.linkedin.com/in/ambergleam","website":"http://www.ambergleam.com","email":null,"phone":"4044215787","phoneticName":null,"gPlus":"https://plus.google.com/+MatthewComptonPlus","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52976,"name":"Android Auto: I retrofitted it in my car and you can too","description":"What happens when an Android engineer wants even more Android?\r\n\r\nAndroid phone in his pocket and Tablet on his desk.  Android TV, Google Glass, and a Nexus Q too.\r\n\r\nBut what if that wasn't enough?  Can you have too much Android?  Not this guy.\r\n\r\nWhat would he do?\r\n\r\nHe would take his old Subaru and through sketchy means he can teach you about, get Android Auto into it, for less money than you might think.\r\n\r\nAnd then?  Then he would start exploring the Android Auto SDK and writing code for his car.\r\n\r\nThat engineer is me.  \r\n\r\nI've talked in Hong Kong and Paris about Android and now I want to tell you my Android Auto story: the procurement, hardware installation, the code, all of it.  I wrote a book about Google Glass software development and can tell you how Android Auto is like those early explorer days of Google Glass development.\r\n\r\nI've taken Android Auto to the highest peaks of Colorado and then snowboarded down them.  Let me tell you my story and I bet if you have a phone in your pocket, watch on your wrist and tablet on your desk all running Android ... you'll want to go out and get Android Auto too, and write your own code for it.\r\n","category":null,"startDate":"03/18/2016 04:20PM","endDate":"03/18/2016 05:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":48553,"name":"Mark Scheel","profile":"Mark Scheel has given Android talks in Hong Kong, Paris, and more than 20 American cities.  He keynoted a DroidCon (in Paris).  He has made small Open Source contributions to Square and Google (Nest, Glass).  He has written a book on Software Development for Google Glass and works on a consumer medical app with over 7 million Play Store downloads.  In search of the best snow in Colorado he puts a lot of miles on his car and decided his car stereo needed an upgrade, which led to this talk.","avatarKey":"https://lh5.googleusercontent.com/-0U4PFAXbl1Q/AAAAAAAAAAI/AAAAAAAAAsE/mYGkXDxvT3c/s96-c/photo.jpg","userCode":"d174f","company":null,"twitter":"5280mark","linkedIn":null,"website":"www.digitalconstruction.com","email":null,"phone":"3035137428","phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52966,"name":"Advanced techniques for concurrency & memory management","description":"Managing memory & concurrency are one of the biggest challenges we face when it comes to writing testable & efficient apps.\r\nbased on the experience of building Realm, We'll dig into some patterns & tricks used to control memory footprint & multithreading. \r\n\r\nSome of the topics this talks will cover are:\r\n- How to use the Java Reference API (WeakReference & ReferenceQueue) to work with the GC\r\n- Writing tests involving the GC\r\n- Working & testing code using the Handler/Looper api\r\n- Alternative asynchronous models (Messenger/ResultReceiver)\r\n- Threadpool customisation & pitfalls \r\n- Handler (mocking & testing, using IdleHandler) ","category":null,"startDate":"03/18/2016 03:30PM","endDate":"03/18/2016 04:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":36411,"name":"Nabil Hachicha","profile":null,"avatarKey":"https://lh5.googleusercontent.com/-ZWVROOY2OpU/AAAAAAAAAAI/AAAAAAAAAN8/0QqZJmxdI1o/s96-c/photo.jpg","userCode":"972fe","company":null,"twitter":null,"linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52973,"name":"Bulletproof Android","description":"This session takes a look at Android security from a developer rather than a hacker's perspective. Taken from the recently published book \"Bulletproof Android,\" we look at how to protect your Android code, how to use secure authentication in your app, how to communicate securely with any backend server and how to safeguard that server against attack. Throughout the session, we'll use real-world examples from the many audits we've done over the years to show how other developers have tried and sometimes failed to secure their code.","category":null,"startDate":"03/18/2016 01:30PM","endDate":"03/18/2016 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":25855,"name":"Godfrey Nolan","profile":"Godfrey is founder and president of RIIS LLC, a mobile development firm in the Detroit Metro area. He is also author of \"Bulletproof Android\", \"Android Best Practices\", \"Decompiling Android\" and \"Decompiling Java.\" Godfrey has spoken at several AnDevcons as well as JavaOne, ASP-Connections, VSLive, Codemash, Code PaLOUsa, 1DevDay and many local Java and .Net user groups on a wide range of topics such as Continuous Integration, Executable Requirements and mobile security.","avatarKey":"021e2980-0974-4809-878c-1d154ebc25ad","userCode":"b1dc","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52968,"name":"Auto profiling apps on every build.","description":"Performance is always a concern when working with resource constrained environments like Android. In addition to that, developers also have to deal with another limited resource: time. It is quite common that adding new features or fixing bugs is way more relevant than ensuring application works smoothly. Just measuring the performance of certain view takes a good amount of time, so why not automate it? At Lyft we found that gathering data with every continuous integration build would help us to not only detect regressions but also to ensure a smooth ride for all our users. ","category":null,"startDate":"03/17/2016 04:30PM","endDate":"03/17/2016 05:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":39502,"name":"Evelio Tarazona Cáceres","profile":"Senior Android Software Engineer @ Lyft, Inc.","avatarKey":"https://lh6.googleusercontent.com/-sobfrQ4jVVs/AAAAAAAAAAI/AAAAAAAExzg/0via-pCdLeQ/s96-c/photo.jpg","userCode":"2b7d0","company":"Lyft, Inc.","twitter":"eveliotc","linkedIn":"https://www.linkedin.com/in/eveliotc","website":"http://evel.io/","email":"eveliotc@gmail.com","phone":"4157351221","phoneticName":null,"gPlus":"https://plus.google.com/+EvelioTarazonaCaceres","nickname":null,"coverKey":null,"facebook":null,"emailPublic":true,"following":false}]},{"id":52974,"name":"Building an Android app with Google's Firebase","description":"Firebase is Google's backend-as-a-service for developing native mobile apps. Frank introduces the main features of Firebase and then live-codes a complete, multi-user Android app from scratch. His promise: no snippets will be copied or auto-expanded. In return he may need your help catching typos and other coding mistakes.","category":null,"startDate":"03/17/2016 01:30PM","endDate":"03/17/2016 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":39100,"name":"Frank van Puffelen","profile":"Frank is an engineer for Firebase at Google. He helps developers build extraordinary apps that use Firebase as their back-end. If you've ever asked a Firebase question on StackOverflow, you've probably met Frank already.","avatarKey":"https://lh4.googleusercontent.com/-lEJDYMsT4F8/AAAAAAAAAAI/AAAAAAAAABI/YyiDE9dTYvI/s96-c/photo.jpg","userCode":"7121c","company":"Google","twitter":"puf","linkedIn":null,"website":"www.firebase.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52969,"name":"Mobile SDKs: Use with Caution! ","description":"We’ve all heard of mobile SDKs. These off-the-shelf services that offer advertising, analytics, social and more. These SDKs are a great help in development process: they offer unique functionality, simplify the coding and save you precious time and money. But SDKs are not really your code. You work hard to ensure your app quality and your users’ safety and privacy in your own code, but can you be liable for these guests SDKs’ code as well? In this presentation, I’ll dive into the two major domains of risk introduced when using SDKs, and spice it up with a few real-life stories on SDKs and what can be done to reduce the risk of using them.","category":null,"startDate":"03/17/2016 05:30PM","endDate":"03/17/2016 06:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":46550,"name":"Orly Shoavi","profile":"Orly Shoavi has held leading positions in R&D, Product Management, Product Marketing and Business Development.  Orly, who focused her entire career on the mobile industry, began as a software engineer at Intel and Radvision and as an Applications Team Leader at modu. She then shifted her focus to Product Management and Business Development at Telmap, which led her back to Intel after the company’s acquisition. There she was part of the management team of the New Devices Israel Group. In the past ten years Orly has dealt with dozens of SDKs integrations: from choosing the right SDKs for the various mobile applications she was involved in to the SDKs implementation and testing. Orly teaches at the Computer Science Faculty at IDC.\r\nOrly is an 8200-alumni and holds a BSc. and an MSc. in Computer Science, both from the Technion (Cum Laude) and an MBA from Tel Aviv University (Cum Laude).","avatarKey":"https://lh3.googleusercontent.com/-Znda6-MgIW8/AAAAAAAAAAI/AAAAAAAAAqQ/4UbDhZO_wZk/s96-c/photo.jpg","userCode":"cddae","company":"SafeDK","twitter":"orlyshoavi","linkedIn":"https://il.linkedin.com/in/orlyshoavi","website":"www.safedk.com","email":null,"phone":"972-52-2829573","phoneticName":null,"gPlus":"https://plus.google.com/+Safedk/posts","nickname":null,"coverKey":null,"facebook":"https://www.facebook.com/orly.meirshoavi","emailPublic":false,"following":false}]}]},{"id":52652,"name":"Track 3","description":"","mapImageUrl":"","events":[{"id":52985,"name":"Using Google Cloud Test Lab to improve the quality of Android apps: A case study from Amex Android apps affecting millions of users","description":"Android testing is hard! With new devices coming out every year, it’s very challenging to ensure the compatibility of your applications across all these form factors. In this talk, we’ll tell you how Cloud Test Lab helps developers address these issues. With a scalable infrastructure that allows you to run automated test on hundreds of devices with one click, a smart Robo that allows you to test your app launches without having to write complex scripts and clients that integrate into your workflow from the web, Android Studio and on your CI environment.\r\n\r\nWe’ll also be hearing from the lead engineer on American Express Android team on how using Cloud Test Lab significantly reduced their infrastructure investment and allowed them to run tens of thousands of tests every day. He’ll be sharing some of the best practices on using Cloud Test Lab in order to get the most benefit in your project.","category":null,"startDate":"03/18/2016 10:10AM","endDate":"03/18/2016 10:50AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":39153,"name":"Ahmed Gad","profile":"Ahmed is a Product Manager at Google Cloud Test Lab. Prior to that he worked as a Software Engineer at Google and Microsoft. He holds a Masters degree in Computer Science from the Universitat Autonoma de Barcelona and he's pursuing an MBA degree at UCLA Anderson School of Management.","avatarKey":"https://lh6.googleusercontent.com/-o275qFHBM84/AAAAAAAAAAI/AAAAAAAAApo/OkfaNZ3C4UA/s96-c/photo.jpg","userCode":"58f28","company":"Google","twitter":"amounir86","linkedIn":"https://www.linkedin.com/in/amounir","website":null,"email":null,"phone":"425-351-8760","phoneticName":null,"gPlus":"https://plus.google.com/+AhmedMounirGad","nickname":null,"coverKey":null,"facebook":"https://www.facebook.com/amounir","emailPublic":false,"following":false}]},{"id":52978,"name":"Media on Android: Components and tricks","description":"When MediaPlayer and MediaRecorder is not flexible enough, what to do? In this talk usages of the media and related components in Android SDK (MediaCodec; AudioTrack; Surface; Renderscript; etc) will be discussed to show how to make apps with custom playback experiences (e.g. speed changes, queues, live streaming) and custom recordings with video effects. ","category":null,"startDate":"03/18/2016 01:30PM","endDate":"03/18/2016 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":11509,"name":"Edison Wang","profile":"Currently the guy responsible for the custom video recording and video playback as well as app architecture on Vine for Android at Twitter Inc.  Prev co-founder for SleepBot and Android Lead at Squarespace.","avatarKey":null,"userCode":"274b","company":"Vine","twitter":"wew","linkedIn":"https://www.linkedin.com/in/edisonwang","website":"http://www.edisonwang.com","email":null,"phone":"3476888860","phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52986,"name":"Fluid Gestures","description":"Material design on Android has ushered an age of delightful animations and meaningful transitions, leading to more engaging and sophisticated apps. But gestures, which tie touch mechanics to hidden actions, have been left behind, relegated to specific tasks, such as reordering or dismissing items in a list.\r\n\r\nThe first half of the talk will cover the design of gestures, as well as the benefits of gestures over the usual tap-based interface. The main emphasis will be on examples of unique, but effective gestures, especially those unique to certain app categories. The traits of a good gesture will be examined, as well as various methods for hinting hidden gestures to users and ideas for adding gestures to existing interfaces.\r\n\r\nThe second half of the talk will dive into implementing gestures using Backboard and Rebound, libraries that help tie user interaction to on-screen motion. Code examples from Tumblr gestures will be used to demonstrate the ease of developing a gesture-based interface, even in a production application. The talk will end with more experimental gestures as inspiration.","category":null,"startDate":"03/18/2016 11:00AM","endDate":"03/18/2016 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":36422,"name":"Eric Leong","profile":"I'm a senior Android engineer at Tumblr.","avatarKey":"83cb9f05-be45-4c76-83b0-ed5776147dd7","userCode":"b8a58","company":"Tumblr","twitter":"ericwleong","linkedIn":"https://www.linkedin.com/in/eric-leong-92347145","website":"http://ericleong.me","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/u/0/103746199749981693463","nickname":null,"coverKey":"e959165a-2048-4fff-a7f4-55507ec08c87_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":52987,"name":"How we take 180-degree spinning photos w/ 19 Android phones","description":"Have you seen Cloud Spin? It's a demo that Google Cloud Developer Advocates (Ray Tsang, Bret McGowen, Francesc Campoy, and Kathy Kam) developed for the Google Cloud Platform Next event series. \r\n\r\nThe demo, consists of 19 Nexus 6 phones were placed around a half-circle pointing inwards to take a picture of the subject at the same moment in time, to create a 180 degree animated GIF - see them at @googlecloudspin twitter!\r\n\r\nBut wait, the Android phones introduces some unknown delays when taking a photo - how did we make all the cameras take pictures at the same time? What did we use to process and stitch the photos together? And most importantly, how did we pull it off in a matter of 3 weeks?\r\n\r\nJoin this session to learn more about what we did behind the scenes, and how we leveraged open source technology, Google Cloud Platform, and Firebase to help us develop the demo rapidly.","category":null,"startDate":"03/18/2016 11:50AM","endDate":"03/18/2016 12:30PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":25860,"name":"Bret McGowen, Ray Tsang","profile":"Bret and Ray are Developer Advocates for the Google Cloud Platform in New York who actually worked on the @googlecloudspin project for the Google Cloud Platform Next event series.<br />\r\n<br />\r\nFollow them on Twitter: @bretmcg and @saturnism","avatarKey":"http://static.sched.org/a6/2148291/avatar.jpg.320x320px.jpg?cfc","userCode":"35b4","company":"Google","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52977,"name":"Rebound","description":"(for Will Bailey)\r\n\r\nRebound is a library we developed at Facebook for bringing lifelike animation to Android. I'll be speaking about simple but powerful techniques that will help you build smooth, fluid, and lively interfaces on Android as well as showing some examples of how we use these techniques in Facebook products.\r\n\r\nSpeaker info: Will is a Software Engineer at Facebook/Instagram who focuses on bringing delightful user experiences to Android. While leading the front end development efforts for Facebook Home, he developed a simple framework (Rebound) and philosophy for coordinating user interfaces with physics. He enjoys applying this approach in his day to day work and sharing his ideas with others through through open source","category":null,"startDate":"03/17/2016 10:00AM","endDate":"03/17/2016 10:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":54052,"name":"Will Bailey","profile":"Will is a Software Engineer at Facebook/Instagram who focuses on bringing delightful user experiences to Android. While leading the front end development efforts for Facebook Home, he developed a simple framework (Rebound) and philosophy for coordinating user interfaces with physics. He enjoys applying this approach in his day to day work and sharing his ideas with others through through open source.","avatarKey":"User_5b1fa297-18e8-4ade-87d3-ac44395e53d5","userCode":"","company":"Facebook","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52982,"name":"Mastering Deep Links for Android","description":"With more than 40,000 apps launching daily, it’s a challenge to stand out. Driving awareness and acquiring users is tough. It’s been shown that deep linking can improve new user retention and in-app conversions by up to 2X. This session will showcase how you can add deep linking to your latest app. We’ll also address deferred and contextual deep linking in theory and action, and best practices to use them. The class will close with specific types of features you can build on top of it to help drive quality new users.","category":null,"startDate":"03/17/2016 12:00PM","endDate":"03/17/2016 12:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":28202,"name":"Evan Groth","profile":"A recovering hacker, Evan has been programming from day one. Evan built the ClassOwl app from blank screen to market in two short months. Evan recently joined Branch Metrics as a member of their evangelist team after building up his Android skills over several years, successfully launching TweetDreams and Excambio Android apps on the Google Play store.","avatarKey":"http://static.sched.org/a6/2199363/avatar.jpg.320x320px.jpg?c27","userCode":"2b0e","company":"Branch Metrics","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52989,"name":"Building a popular open source Android library - best practices and lessons learned","description":"Building the same components from scratch for your Android projects time after time just doesn’t make sense. This is why libraries are really powerful — we can use them to help us more easily build our creative projects. You should never roll your own when you’re building an Android application, but instead save yourself the headache by taking advantage of the hundreds of libraries available. And if you build something cool yourself, why not share it with the world?\r\n\r\nIn this talk, we’ll look at what it takes to build an open-source Android library and share it with the world, learning from examples like android-async-http, a project that’s been downloaded millions of times and is used in apps like Instagram and Pinterest.","category":null,"startDate":"03/18/2016 02:20PM","endDate":"03/18/2016 03:00PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":46702,"name":"James Smith","profile":"James Smith is a British entrepreneur and software engineer based in San Francisco.\r\n\r\nI'm the co-founder and CEO of Bugsnag, the leading real-time crash detection service for mobile and web applications. To date, Bugsnag has processed billions application crashes from thousands of top technology companies, including Square, Airbnb, GitHub, Cisco and Pandora.\r\n\r\nI've also built a number of popular open-source projects which you can find on my GitHub (https://github.com/loopj).\r\n\r\nOriginally from London, I attended the University of Bath and hold a degree in Mathematics and Computer Science, and moved to the Bay Area in 2009.","avatarKey":"https://lh6.googleusercontent.com/-G2-fH-SXV3s/AAAAAAAAAAI/AAAAAAAAABk/Kkr_GQcCf64/s96-c/photo.jpg","userCode":"498a6","company":"Bugsnag","twitter":"loopj","linkedIn":"https://www.linkedin.com/in/loopj","website":"https://loopj.com","email":null,"phone":"4156132704","phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52979,"name":"From Right to Left and Back","description":"Arabic, Farsi, Hebrew, and Urdu are all very popular languages (Arabic, for example, is the 5th most spoken language in the world). As more and more Android developers begin targeting regions outside the US and Europe, supporting RTL becomes critical for capturing those audiences.\r\n\r\nThis talk will discuss:\r\n- an overview of RTL languages\r\n- what Android gives you before and after api 17\r\n- how the framework implements RTL in various ViewGroups\r\n- some tips and tricks for supporting RTL in your app","category":null,"startDate":"03/17/2016 03:30PM","endDate":"03/17/2016 04:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":47303,"name":"Ahmed El-Helw","profile":null,"avatarKey":"https://lh5.googleusercontent.com/-8CbVm8Z7RkQ/AAAAAAAAAAI/AAAAAAAAA80/DHCTjwElg4s/s96-c/photo.jpg","userCode":"7e260","company":"Facebook","twitter":"ahmedre","linkedIn":"http://linkedin.com/in/ahmedre","website":"http://helw.net","email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/u/0/104432113815960557704","nickname":null,"coverKey":null,"facebook":"http://facebook.com/ahmedre","emailPublic":false,"following":false}]},{"id":52984,"name":"360 Videos on Android and in Virtual Reality","description":"This talk will give an overview of the 360 video format and dive into the technical details around 360 video capture, rendering, and playback in virtual reality. It will also cover some of the challenges and solutions to streaming 4k and even higher resolution 360 videos on slow networks.\r\n\r\nPierre is an Android VR Engineer at Facebook who works on 360 Videos on Facebook for Android and Oculus Video for the Samsung GearVR.","category":null,"startDate":"03/17/2016 05:30PM","endDate":"03/17/2016 06:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":11504,"name":"Pierre-Antoine LaFayette","profile":"Android engineer at Facebook working on mobile VR. Former graphics engineer at Qualcomm working on the Android Browser. Past open source contributor to Google Chrome (Chromium).","avatarKey":null,"userCode":"de0c","company":null,"twitter":"03lafaye","linkedIn":null,"website":null,"email":null,"phone":null,"phoneticName":null,"gPlus":"https://plus.google.com/u/0/+PierreAntoineLaFayette/posts","nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52980,"name":"Building beautiful & performant user interfaces","description":"People often associate Android apps with less charming user interfaces. Yet with the correct set of frameworks and UI performance optimizations, we can create pleasant user experiences that are both aesthetically pleasing and highly performant. I’ll be discussing the immersive video viewer on Instagram as an example to demonstrate how Android apps can look and feel just as great (if not better) than their iOS counterparts.\r\n\r\nSpeaker Info: Kevin is a Software Engineer at Facebook/Instagram who pursues smooth, interactive designs on Android. Recently he built the new video consumption experience on Instagram, hosting the best content from Halloween, New Year’s Eve, and other celebratory events for people to watch and have fun.","category":null,"startDate":"03/17/2016 11:00AM","endDate":"03/17/2016 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":54053,"name":"Kevin Jung","profile":"Kevin is a Software Engineer at Facebook/Instagram who pursues smooth, interactive designs on Android. Recently he built the new video consumption experience on Instagram, hosting the best content from Halloween, New Year’s Eve, and other celebratory events for people to watch and have fun.","avatarKey":"User_d637bc3a-37fa-412d-a30a-ad97552daa14","userCode":"","company":"Instagram","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52988,"name":"Android (and/or Unity?) for VR and more","description":"This talk is a deep dive into code to demonstrate how Android developers can migrate and co-exist with Unity development for VR (and AR) apps (one to one comparisons as well as plugins).  We'll walk through sample code for Cardboard, Tango and even non-Google sample code for additional VR and AR headsets.","category":null,"startDate":"03/17/2016 01:30PM","endDate":"03/17/2016 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5664,"name":"Dario Laverde","profile":"Dario Laverde is a senior developer evangelist at HTC. He has experience in software development for mobile, embedded, Web and enterprise. Among his various professional roles, he has worked as an Android instructor, consultant, Java architect, author and entrepreneur. Dario leads the NYC-GDG (Google Developer Group), the NYCJava JUG, and co-organizes the New York Android Developers Meetup. He also runs the New York City based skylight1 open-source Android projects group that is currently working on Android Wear and Google Glass projects.","avatarKey":"http://static.sched.org/a4/1356606/avatar.jpg.320x320px.jpg?a71","userCode":"75af","company":"HTC","twitter":null,"linkedIn":null,"website":"http://htcdev.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"c931d343-1424-4ac5-b166-0cb8308e2a86_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":54100,"name":"Dynamic Layouts in Android","description":"Changing UI and updates based on user feedback is a never ending task. Running A/B tests to try UI variants is also a challenge. Options include releasing an app upgrade, bundling app with multiple layouts for A/B tests, using HTML, writing custom layout parser, and implementing custom markup language. We present an alternative to WebView - using precompiled layouts and native LayoutInflater. This is the fastest that you can get using built-in API. Similar to other alternatives, this alternative has its pros and cons. We present the scenarios where it can be useful. We also present the risks and their mitigation.","category":null,"startDate":"03/18/2016 09:20AM","endDate":"03/18/2016 10:00AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":54050,"name":"Gaurav Vaish","profile":"Gaurav Vaish works as Principal Engineer with Yahoo, Sunnyvale. His passion lies in working with connected devices. He led the mobile engineering for native apps and is currently working on an unannounced initiative. He started his career in 2002 with Adobe Systems India working in their engineering solutions group. In 2005, he started his own company, Edujini Labs, focusing on corporate training and collaborative learning. He holds a B. Tech. degree in Electrical Engineering with a specialization in Speech Signal Processing from IIT Kanpur, India. Gaurav is the author of the books \"Getting Started with NoSQL\" and “High Performance iOS Apps”.","avatarKey":"User_b12007e3-62e0-4fef-b83f-5236e1d28a31","userCode":"","company":"Yahoo","twitter":"","linkedIn":"","website":"www.m10v.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":54101,"name":"Simplify Your Code with RxJava","description":"ReactiveX, also known as Rx, is gaining more popularity in the Android community, as it offers a declarative way for developer to express their intent, which results in more readable, robust, and performant code in Rx world. Yahoo’s Video SDK is all about events: Network event, ads event, player event, error handling event, user event, and more. In most cases managing events could be very hard, especially when it has interdependencies among other object's state, and is a result of nested callbacks.\r\nIn this talk, I will share on how we gain the benefits from Rx (with the implementation in RxJava), by refactoring the code with reactive paradigm when working in Yahoo Android Video SDK.","category":null,"startDate":"03/18/2016 03:30PM","endDate":"03/18/2016 04:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":54051,"name":"Ferry Tanu","profile":"Ferry Tanu is a Senior Software Engineer at Yahoo, currently working on the Android Video SDK team. He is a passionate full stack engineer with more than 15 years of experience and is fascinated with the potential of the reactive programming paradigm.","avatarKey":"User_2998f3bb-bd45-4724-bf0a-19b4b96ce283","userCode":"","company":"Yahoo","twitter":"","linkedIn":"","website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":52981,"name":"Make Lists Magical with RecyclerView's ItemTouchHelper","description":"ItemTouchHelper was added to RecyclerView back in 22.2 and adds a lot of power to responding to touch events in RecyclerViews. Come not just to learn how to make your lists delight users but also to dig into how ItemTouchHelper really works in your RecyclerViews.","category":null,"startDate":"03/17/2016 02:30PM","endDate":"03/17/2016 03:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":8900,"name":"Eric Cochran","profile":"I strive to build delightful experiences for users' most personal devices. At IFTTT, I have the pleasure of working with a broad range of Android APIs and features across four apps. We love to connect and automate all the things, and Android has been no small part of that dream. I love constantly learning and building new techniques, and Android provides both a great platform and an excellent community for devs.","avatarKey":"b35eab0d-8e49-4f7e-9a91-adae87f940e6","userCode":"caa9","company":"IFTTT","twitter":"Eric_Cochran","linkedIn":null,"website":null,"email":null,"phone":"(678) 948-7362","phoneticName":null,"gPlus":"+EricCochranNightlyNexus","nickname":null,"coverKey":"ad92a9e1-45fc-46a3-b95c-839e9c54f075_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":52983,"name":"I want my (Android)TV","description":"In this talk, I will demonstrate how to write an Android TV app, using the Udemy TV app as an example. I will talk about how I used the Leanback library to create a TV playback app based on the main Udemy Android app, how I integrated with Android TV to create a search and discovery experience and how I reused the the existing code and other code resources to create the TV app. ","category":null,"startDate":"03/17/2016 04:30PM","endDate":"03/17/2016 05:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":45951,"name":"Effie (Efrat) Barak","profile":"I work at Udemy as an Android developer on the mobile team, responsible for the Android app development and leading the development of the Android TV prototype.\r\n\r\nI began working as a C# developer 10 years ago. I became a mobile developer 4 years ago, and released many Windows and Windows Phone apps. After moving to San Francisco in 2013, I worked for Slack on the Windows Phone app.","avatarKey":"https://lh3.googleusercontent.com/-G_-RiOY85vo/AAAAAAAAAAI/AAAAAAAABUo/K6IZPhG9Aj4/s96-c/photo.jpg","userCode":"b73fd","company":"Udemy","twitter":"CodingChick","linkedIn":null,"website":null,"email":null,"phone":"4157128513","phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]}],"blocks":[{"id":53650,"name":"Lunch","description":"","startDate":"03/17/2016 12:40PM","endDate":"03/17/2016 01:30PM"},{"id":53651,"name":"Lunch","description":"","startDate":"03/18/2016 12:30PM","endDate":"03/18/2016 01:30PM"},{"id":53751,"name":"Break","description":"","startDate":"03/18/2016 03:00PM","endDate":"03/18/2016 03:30PM"}]}